Vulnerability-report-main/ADDRVAL-ESB/AddrValidation-war/src/test/resources/TEST_TWO_FC_NOD.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:v4="http://validator5.AddressDoctor.com/Webservice5/v4">
   <soapenv:Header/>
   <soapenv:Body>
      <v4:Process>
         <v4:parameters>
            <v4:ProcessMode>FASTCOMPLETION</v4:ProcessMode>
         </v4:parameters>
         <v4:addresses>
             
            <v4:Address>
               <v4:Street>
                  <v4:string>1405 Douglas Street</v4:string>
               </v4:Street>
               <v4:Locality>
                  <v4:string>Victoria</v4:string>
               </v4:Locality>
               <v4:PostalCode>
                  <v4:string>V8W 2G2</v4:string>
               </v4:PostalCode>
               <v4:Province>
                  <v4:string>BC</v4:string>
               </v4:Province>
               <v4:Country>
                  <v4:string>Canada</v4:string>
               </v4:Country>
            </v4:Address>
            
            <v4:Address>
               <v4:Street>
                  <v4:string>728 Yates Street</v4:string>
               </v4:Street>
               <v4:Locality>
                  <v4:string>Victoria</v4:string>
               </v4:Locality>
               <v4:PostalCode>
                  <v4:string>V8W 0C8</v4:string>
               </v4:PostalCode>
               <v4:Province>
                  <v4:string>BC</v4:string>
               </v4:Province>
               <v4:Country>
                  <v4:string>Canada</v4:string>
               </v4:Country>
            </v4:Address>
            
         </v4:addresses>
      </v4:Process>
   </soapenv:Body>
</soapenv:Envelope>